package first;

public class Object1006 {

	public static void main(String[] args) {
/*	#객체지향이란?
 		변수와 메서드를 가지고 있는 하나의 묶음
  		클래스 => 변수와 메서드
  		cpu <----> memory
  		변수,메서드-> memory
  	#객체지향의 목적
  		내가 필요할때 만들어서 사용
  		class=객체 정의서
  	#클래스
  		클래스는 인스턴스를 만들 수 있는 설계도
  	#객체지향언어의 특징
  	1) 코드의 재 사용성이 높다.
  	 - 새로운 코드를 작성할 때 기존 코드를 이용해 쉽게 작성 가능
  	2) 코드 관리가 쉽다.
  	 - 코드간 관계를 맺어줌으로써 적은 노력으로 코드변경 가능
  	3) 신뢰성 높은 프로그램 개발 가능
  	 - 제어자,메서드로 데이터를 보호, 코드 중복 제거
  	
  	#객체란?
  	사물,업무 프로세스
	클래스(도면)-> 객체(인스턴스)-변수,메서드
  	#클래스란
  	객체를 정의해 놓은 것
  	클래스는 객체를 생성하는데 사용됨
	
	ex) tv
	객체(tv) :변수(속성-크기,길이)+메서드(기능-켜기,끄기,볼륨) 
	ex) 회원관리
	객체(회원):변수(속성-id,이름)+메서드-(기능-정보 출력)

//과일장수의 행위 표현
 int saleApple ( int money )  // 사과 구매금액이 매소드의 인자로 전달
 
 {
   int num = money/1000; // 사과가 개당 1000원 이라 가정 
   numOfApple -= num;    // 사과의 개수가 줄어 듬.
   myMoney += money;    // 판매 수익이 발생 함. 
   return num;          // 실제 구매가 발생한 사과의 수를 반환
 
 } 
 */
		
	
		
	}

}
